; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	image0 - mode
	thermograph3 - mode
	image1 - mode
	thermograph2 - mode
	GroundStation0 - direction
	Star1 - direction
	Star2 - direction
	Star3 - direction
	Phenomenon4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph2)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 Star1)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 116)
	(= (data Star3 image0) 236)
	(= (data Phenomenon4 image0) 249)
	(= (data Phenomenon5 image0) 156)
	(= (data Star6 image0) 186)
	(= (data Phenomenon7 image0) 105)
	(= (data Star8 image0) 50)
	(= (data Star3 thermograph3) 289)
	(= (data Phenomenon4 thermograph3) 186)
	(= (data Phenomenon5 thermograph3) 63)
	(= (data Star6 thermograph3) 5)
	(= (data Phenomenon7 thermograph3) 292)
	(= (data Star8 thermograph3) 229)
	(= (data Star3 image1) 57)
	(= (data Phenomenon4 image1) 178)
	(= (data Phenomenon5 image1) 126)
	(= (data Star6 image1) 102)
	(= (data Phenomenon7 image1) 15)
	(= (data Star8 image1) 275)
	(= (data Star3 thermograph2) 51)
	(= (data Phenomenon4 thermograph2) 160)
	(= (data Phenomenon5 thermograph2) 221)
	(= (data Star6 thermograph2) 73)
	(= (data Phenomenon7 thermograph2) 2)
	(= (data Star8 thermograph2) 8)
	(= (slew_time Star1 GroundStation0) 45.51)
	(= (slew_time GroundStation0 Star1) 45.51)
	(= (slew_time Star2 GroundStation0) 4.789)
	(= (slew_time GroundStation0 Star2) 4.789)
	(= (slew_time Star2 Star1) 1.377)
	(= (slew_time Star1 Star2) 1.377)
	(= (slew_time Star3 GroundStation0) 66.75)
	(= (slew_time GroundStation0 Star3) 66.75)
	(= (slew_time Star3 Star1) 51.21)
	(= (slew_time Star1 Star3) 51.21)
	(= (slew_time Star3 Star2) 6.03)
	(= (slew_time Star2 Star3) 6.03)
	(= (slew_time Phenomenon4 GroundStation0) 21.69)
	(= (slew_time GroundStation0 Phenomenon4) 21.69)
	(= (slew_time Phenomenon4 Star1) 12.22)
	(= (slew_time Star1 Phenomenon4) 12.22)
	(= (slew_time Phenomenon4 Star2) 57.19)
	(= (slew_time Star2 Phenomenon4) 57.19)
	(= (slew_time Phenomenon4 Star3) 17.01)
	(= (slew_time Star3 Phenomenon4) 17.01)
	(= (slew_time Phenomenon5 GroundStation0) 64.5)
	(= (slew_time GroundStation0 Phenomenon5) 64.5)
	(= (slew_time Phenomenon5 Star1) 22.43)
	(= (slew_time Star1 Phenomenon5) 22.43)
	(= (slew_time Phenomenon5 Star2) 60.7)
	(= (slew_time Star2 Phenomenon5) 60.7)
	(= (slew_time Phenomenon5 Star3) 29.15)
	(= (slew_time Star3 Phenomenon5) 29.15)
	(= (slew_time Phenomenon5 Phenomenon4) 0.9513)
	(= (slew_time Phenomenon4 Phenomenon5) 0.9513)
	(= (slew_time Star6 GroundStation0) 64.1)
	(= (slew_time GroundStation0 Star6) 64.1)
	(= (slew_time Star6 Star1) 17.83)
	(= (slew_time Star1 Star6) 17.83)
	(= (slew_time Star6 Star2) 6.916)
	(= (slew_time Star2 Star6) 6.916)
	(= (slew_time Star6 Star3) 75.59)
	(= (slew_time Star3 Star6) 75.59)
	(= (slew_time Star6 Phenomenon4) 0.3637)
	(= (slew_time Phenomenon4 Star6) 0.3637)
	(= (slew_time Star6 Phenomenon5) 47.8)
	(= (slew_time Phenomenon5 Star6) 47.8)
	(= (slew_time Phenomenon7 GroundStation0) 42.86)
	(= (slew_time GroundStation0 Phenomenon7) 42.86)
	(= (slew_time Phenomenon7 Star1) 2.055)
	(= (slew_time Star1 Phenomenon7) 2.055)
	(= (slew_time Phenomenon7 Star2) 19.7)
	(= (slew_time Star2 Phenomenon7) 19.7)
	(= (slew_time Phenomenon7 Star3) 19)
	(= (slew_time Star3 Phenomenon7) 19)
	(= (slew_time Phenomenon7 Phenomenon4) 17.25)
	(= (slew_time Phenomenon4 Phenomenon7) 17.25)
	(= (slew_time Phenomenon7 Phenomenon5) 12.7)
	(= (slew_time Phenomenon5 Phenomenon7) 12.7)
	(= (slew_time Phenomenon7 Star6) 18.78)
	(= (slew_time Star6 Phenomenon7) 18.78)
	(= (slew_time Star8 GroundStation0) 4.838)
	(= (slew_time GroundStation0 Star8) 4.838)
	(= (slew_time Star8 Star1) 9.883)
	(= (slew_time Star1 Star8) 9.883)
	(= (slew_time Star8 Star2) 3.746)
	(= (slew_time Star2 Star8) 3.746)
	(= (slew_time Star8 Star3) 46.05)
	(= (slew_time Star3 Star8) 46.05)
	(= (slew_time Star8 Phenomenon4) 24.72)
	(= (slew_time Phenomenon4 Star8) 24.72)
	(= (slew_time Star8 Phenomenon5) 47.99)
	(= (slew_time Phenomenon5 Star8) 47.99)
	(= (slew_time Star8 Star6) 17.29)
	(= (slew_time Star6 Star8) 17.29)
	(= (slew_time Star8 Phenomenon7) 26.15)
	(= (slew_time Phenomenon7 Star8) 26.15)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Phenomenon4 thermograph3)
	(have_image Star6 image1)
	(have_image Phenomenon7 thermograph3)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 phenomenon7 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 116 to 113.945, (fuel-used) from 0 to 2.055
   goals met: 0 of 3
2. (turn_to satellite0 star1 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 113.945 to 111.89, (fuel-used) from 2.055 to 4.11
   goals met: 0 of 3
3. (turn_to satellite0 star2 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 111.89 to 110.513, (fuel-used) from 4.11 to 5.487
   goals met: 0 of 3
4. (turn_to satellite0 star1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 110.513 to 109.136, (fuel-used) from 5.487 to 6.864
   goals met: 0 of 3
5. (turn_to satellite0 star2 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 109.136 to 107.759, (fuel-used) from 6.864 to 8.241
   goals met: 0 of 3
6. (turn_to satellite0 star1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 107.759 to 106.382, (fuel-used) from 8.241 to 9.618
   goals met: 0 of 3
7. (turn_to satellite0 star2 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 106.382 to 105.005, (fuel-used) from 9.618 to 10.995
   goals met: 0 of 3
8. (turn_to satellite0 star1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 105.005 to 103.628, (fuel-used) from 10.995 to 12.372
   goals met: 0 of 3
9. (turn_to satellite0 star2 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 103.628 to 102.251, (fuel-used) from 12.372 to 13.749
   goals met: 0 of 3
10. (turn_to satellite0 star1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 102.251 to 100.874, (fuel-used) from 13.749 to 15.126
   goals met: 0 of 3
11. (turn_to satellite0 star2 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 100.874 to 99.497, (fuel-used) from 15.126 to 16.503
   goals met: 0 of 3
12. (turn_to satellite0 star1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 99.497 to 98.12, (fuel-used) from 16.503 to 17.88
   goals met: 0 of 3
13. (turn_to satellite0 star2 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 98.12 to 96.743, (fuel-used) from 17.88 to 19.257
   goals met: 0 of 3
14. (turn_to satellite0 star1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 96.743 to 95.366, (fuel-used) from 19.257 to 20.634
   goals met: 0 of 3
15. (turn_to satellite0 star2 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 95.366 to 93.989, (fuel-used) from 20.634 to 22.011
   goals met: 0 of 3
16. (turn_to satellite0 star1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 93.989 to 92.612, (fuel-used) from 22.011 to 23.388
   goals met: 0 of 3
17. (turn_to satellite0 star2 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 92.612 to 91.235, (fuel-used) from 23.388 to 24.765
   goals met: 0 of 3
18. (turn_to satellite0 star1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 91.235 to 89.858, (fuel-used) from 24.765 to 26.142
   goals met: 0 of 3
19. (turn_to satellite0 star2 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 89.858 to 88.481, (fuel-used) from 26.142 to 27.519
   goals met: 0 of 3
20. (turn_to satellite0 star1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 88.481 to 87.104, (fuel-used) from 27.519 to 28.896
   goals met: 0 of 3
21. (turn_to satellite0 star2 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 87.104 to 85.727, (fuel-used) from 28.896 to 30.273
   goals met: 0 of 3
22. (turn_to satellite0 star1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 85.727 to 84.35, (fuel-used) from 30.273 to 31.65
   goals met: 0 of 3
23. (turn_to satellite0 star2 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 84.35 to 82.973, (fuel-used) from 31.65 to 33.027
   goals met: 0 of 3
24. (turn_to satellite0 star1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 82.973 to 81.596, (fuel-used) from 33.027 to 34.404
   goals met: 0 of 3
25. (turn_to satellite0 star2 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 81.596 to 80.219, (fuel-used) from 34.404 to 35.781
   goals met: 0 of 3
26. (turn_to satellite0 star1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 80.219 to 78.842, (fuel-used) from 35.781 to 37.158
   goals met: 0 of 3
27. (turn_to satellite0 star2 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 78.842 to 77.465, (fuel-used) from 37.158 to 38.535
   goals met: 0 of 3
28. (turn_to satellite0 star1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 77.465 to 76.088, (fuel-used) from 38.535 to 39.912
   goals met: 0 of 3
29. (turn_to satellite0 star2 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 76.088 to 74.711, (fuel-used) from 39.912 to 41.289
   goals met: 0 of 3
30. (turn_to satellite0 star1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 74.711 to 73.334, (fuel-used) from 41.289 to 42.666
   goals met: 0 of 3
31. (turn_to satellite0 star2 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 73.334 to 71.957, (fuel-used) from 42.666 to 44.043
   goals met: 0 of 3
32. (turn_to satellite0 star1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 71.957 to 70.58, (fuel-used) from 44.043 to 45.42
   goals met: 0 of 3
33. (turn_to satellite0 star2 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 70.58 to 69.203, (fuel-used) from 45.42 to 46.797
   goals met: 0 of 3
34. (turn_to satellite0 star1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 69.203 to 67.826, (fuel-used) from 46.797 to 48.174
   goals met: 0 of 3
35. (turn_to satellite0 star2 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 67.826 to 66.449, (fuel-used) from 48.174 to 49.551
   goals met: 0 of 3
36. (turn_to satellite0 star1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 66.449 to 65.072, (fuel-used) from 49.551 to 50.928
   goals met: 0 of 3
37. (turn_to satellite0 star2 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 65.072 to 63.695, (fuel-used) from 50.928 to 52.305
   goals met: 0 of 3
38. (turn_to satellite0 star1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 63.695 to 62.318, (fuel-used) from 52.305 to 53.682
   goals met: 0 of 3
39. (turn_to satellite0 star2 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 62.318 to 60.941, (fuel-used) from 53.682 to 55.059
   goals met: 0 of 3
40. (turn_to satellite0 star1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 60.941 to 59.564, (fuel-used) from 55.059 to 56.436
   goals met: 0 of 3
41. (turn_to satellite0 star2 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 59.564 to 58.187, (fuel-used) from 56.436 to 57.813
   goals met: 0 of 3
42. (turn_to satellite0 star1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 58.187 to 56.81, (fuel-used) from 57.813 to 59.19
   goals met: 0 of 3
43. (turn_to satellite0 phenomenon7 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 56.81 to 54.755, (fuel-used) from 59.19 to 61.245
   goals met: 0 of 3
44. (turn_to satellite0 phenomenon4 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon4)
   changed: (fuel satellite0) from 54.755 to 37.505, (fuel-used) from 61.245 to 78.495
   goals met: 0 of 3
45. (turn_to satellite0 star1 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 37.505 to 25.285, (fuel-used) from 78.495 to 90.715
   goals met: 0 of 3
46. (turn_to satellite0 phenomenon7 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 25.285 to 23.23, (fuel-used) from 90.715 to 92.77
   goals met: 0 of 3
47. (turn_to satellite0 star1 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 23.23 to 21.175, (fuel-used) from 92.77 to 94.825
   goals met: 0 of 3
48. (turn_to satellite0 star2 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 21.175 to 19.798, (fuel-used) from 94.825 to 96.202
   goals met: 0 of 3
49. (turn_to satellite0 star1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 19.798 to 18.421, (fuel-used) from 96.202 to 97.579
   goals met: 0 of 3
50. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 3
51. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 0 of 3
52. (turn_to satellite0 phenomenon7 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 18.421 to 16.366, (fuel-used) from 97.579 to 99.634
   goals met: 0 of 3
53. (take_image satellite0 phenomenon7 instrument0 thermograph3)
   added: (have_image phenomenon7 thermograph3)
   changed: (data_capacity satellite0) from 1000 to 708, (data-stored) from 0 to 292
   goals met: 1 of 3
54. (turn_to satellite0 star1 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 16.366 to 14.311, (fuel-used) from 99.634 to 101.689
   goals met: 1 of 3
55. (turn_to satellite0 phenomenon4 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon4)
   changed: (fuel satellite0) from 14.311 to 2.091, (fuel-used) from 101.689 to 113.909
   goals met: 1 of 3
56. (take_image satellite0 phenomenon4 instrument0 thermograph3)
   added: (have_image phenomenon4 thermograph3)
   changed: (data_capacity satellite0) from 708 to 522, (data-stored) from 292 to 478
   goals met: 2 of 3
57. (turn_to satellite0 star6 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 2.091 to 1.7273, (fuel-used) from 113.909 to 114.273
   goals met: 2 of 3
58. (take_image satellite0 star6 instrument0 image1)
   added: (have_image star6 image1)
   changed: (data_capacity satellite0) from 522 to 420, (data-stored) from 478 to 580
   goals met: 3 of 3
